app/controllers/books_controller.rb

  def home
    @books = Abook.all
---
SELECT "abooks".* FROM "abooks"

  def create
    @book = Abook.new(params.require(:abook).permit(:title, :author, :genre, :price, :published_date))
    if @book.save
---
INSERT INTO "abooks" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2020-09-12 20:23:36.094200"], ["updated_at", "2020-09-12 20:23:36.094200"]]

  def edit
    @book = Abook.find(params[:id])
---
SELECT "abooks".* FROM "abooks" WHERE "abooks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
    @book = Abook.find(params[:id])
    if @book.update_attributes(params.require(:abook).permit(:title, :author, :genre, :price, :published_date))
---
SELECT "abooks".* FROM "abooks" WHERE "abooks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "abooks" SET "genre" = $1, "published_date" = $2, "updated_at" = $3 WHERE "abooks"."id" = $4  [["genre", "Children"], ["published_date", ""], ["updated_at", "2020-09-12 22:07:16.693319"], ["id", 2]]

  def show
    @book = Abook.find(params[:id])
---
SELECT "abooks".* FROM "abooks" WHERE "abooks"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]

  def delete
    @book = Abook.find(params[:id])
---
SELECT "abooks".* FROM "abooks" WHERE "abooks"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]

  def destroy
    @book = Abook.find(params[:id])
    @book.destroy
---
SELECT "abooks".* FROM "abooks" WHERE "abooks"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
DELETE FROM "abooks" WHERE "abooks"."id" = $1  [["id", 17]]